Revit 2026 API

# FamilyManagerParameter(String) Property

---

Obtains the parameter of this type with a given name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyParameter this[
	string parameterName
] { get; }
```
```vb
Public ReadOnly Property Parameter (
	parameterName As String
) As FamilyParameter
	Get
```
```cpp
public:
property FamilyParameter^ Parameter[String^ parameterName] {
	FamilyParameter^ get (String^ parameterName);
}
```
```fsharp
member Parameter : FamilyParameter with get
```

#### Parameters

parameterName String

#### Property Value

FamilyParameter

Returns  if the parameter is not found.

#### Reference

FamilyManager Class

Parameter Overload

Autodesk.Revit.DB Namespace